Tekla Open API Reference for Tekla Structures 2025
StructuresExtender.CanExtend Method
 Specifies whether the current object can provide its extender properties to the specified object.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CanExtend(
	Object extendee
)
Public Function CanExtend (
	extendee As Object
) As Boolean
Parameters
extendee
Type: System.Object
The object to receive the extender properties.
Return Value
Type: Boolean
True if the current object can provide its extender properties to the specified object; otherwise, false.
Implements
IExtenderProvider.CanExtend(Object)
See Also
Reference
StructuresExtender Class
Tekla.Structures.Dialog Namespace